<?
/*
 *
	 Улучшенно
	конструкторы регуляёрных выражений
		общие
			1. Num  все цифры из строки
			2. En   только английские буквы
			3. Ru   только русские буквы
			4. S    пробел
		уникальные
			1. Html [& / \ \s]
			2. Href [& / \ ? : %]
			3. Date [. -]
			4. Time [:]
			5. Sentence [" , . ! () - ; : ? \s]
 *
 * */

# general
$this->regexp['enL']='a-z';
$this->regexp['enU']='A-Z';
$this->regexp['ruL']='а-яё';
$this->regexp['ruU']='А-ЯЁ';
$this->regexp['S']='\s';
$this->regexp['N']='\n';

# uniq
$this->regexp['num']=array('0-9','\-');
$this->regexp['float']=array('0-9','\.','\,','\-');
$this->regexp['en']=array('a-z','A-Z');
$this->regexp['ru']=array('а-яё','А-ЯЁ');
$this->regexp['html']=array('a-z','A-Z','а-яё','А-ЯЁ','0-9','\&','\/','\\','\S','\<','\>','\"','\,','\.','\!','\(','\)','\-','\;','\:','\?','\=','\t',' ','_');
$this->regexp['script']=array('_','\|','\]','\[','\{','\}','\#','a-z','A-Z','а-яё','А-ЯЁ','0-9','\&','\/','\\','\S','\<','\>','\"','\,','\.','\!','\(','\)','\-','\;','\:','\?','\=','\t',' ','\%','\+');
$this->regexp['href']=array('\&','\/','\\','\?','\:','\%','0-9','a-z','A-Z','.','-',',','=','_');
$this->regexp['date']=array('\.','\-','0-9');
$this->regexp['time']=array('\:','0-9');
$this->regexp['name']=array('a-z','A-Z','а-яё','А-ЯЁ','0-9','\-','\.','\s','_');
$this->regexp['companyName']=array('a-z','A-Z','а-яё','А-ЯЁ','0-9','\-','\.','\s','_','\"','\,');
$this->regexp['phone']=array('0-9','\-','\+','\s','\(','\)');

$this->regexp['sentence']=array('#','№','\$','\"','\,','\.','\!','\(','\)','\-','\;','\:','\?','\s','\\','\/','0-9','a-z','A-Z','а-яё','А-ЯЁ','\%','\+','_');
$this->regexp['getpar']=array('a-z','A-Z','0-9','_','\-');
$this->regexp['search']=array('a-z','A-Z','а-яё','А-ЯЁ','0-9','\+','\-','\<','\>','\(','\)','\s');
$this->regexp['link']=array('a-z','A-Z','0-9','\.','\?','\&','\%','\-','_','\/','\:','\,','\=');
$this->regexp['email']=array('a-z','A-Z','0-9','\.','\@','\-','\_');
$this->regexp['pass']=array('a-z','A-Z','а-яё','А-ЯЁ','0-9','\-','\.','\s');
$this->regexp['listNum']=array('0-9',',');
?>